[
{
   "grafs":[
       "I was born and raised in Brooklyn, New York, a vibrant, colorful place where there was no shortage of culture, creativity, and characters. I attended Binghamton University for my undergraduate studies, majoring in Psychology and minoring in Theater- this is where I determined that my passion lies in connecting with and learning about people.  Nothing makes me feel more ALIVE!",

      "I next attended Brooklyn College's School Psychology graduate program, after which I practiced as a psychologist for several years, primarily working with adolescents in the Brooklyn High Schools. During this time, I also continued acting, taking numerous classes and performing regularly with a theater company, “The Actor's Playground,” which became my own form of therapy.Performing helped me uncover new layers of myself and better understand the impact I can have on others, which in turn bolstered my ability to connect and empower those around me.",

      "In 2005, my husband and I moved from New York to Los Angeles for a “brief” adventure, but we began thriving in our careers and loved the weather, so we decided to stay. In 2009, after years of separately pursuing acting and coaching, I formally combined my passions for creativity and helping others into a single company, and LG Management was born (coincidentally, my daughter was also born that year!). LG Management has two distinct but related sides, talent management and coaching. On the talent management side, I develop and represent artists through all stages and aspects of their acting careers; on the coaching side, I facilitate growth and self-discovery for clients across an array of fields, ranging from artists to corporate executives.",
 
      "In short, LG Management helps shape lives and build careers. Whether it's working with actors to cultivate their strengths and tailor their marketing materials or with executives to lead their teams and implement healthier work and lifestyle choices, the goal is always to keep evolving and improving. With support, patience and intention, I help clients undergo beautiful transformations improving their self-image, their relationships and their careers."  
   ]
}
]